export const areaColumn= {
  data() {
    return {
      area_columns: [
        {
            text: '省本级',
            code: '0',
            children: [
                {text: '全部', code: '000'}
            ]
        },
        {
            text: '哈尔滨市',
            code: '230100000000',
            children: [
                {text: '全部', code: '230100000000all'},
                {text: '道里区', code: '230102000000'},
                {text: '南岗区', code: '230103000000'},
                {text: '道外区', code: '230104000000'},
                {text: '平房区', code: '230108000000'},
                {text: '松北区', code: '230109000000'},
                {text: '香坊区', code: '230110000000'},
                {text: '呼兰区', code: '230111000000'},
                {text: '阿城区', code: '230112000000'},
                {text: '双城区', code: '230113000000'},
                {text: '依兰县', code: '230123000000'},
                {text: '方正县', code: '230124000000'},
                {text: '宾县', code: '230125000000'},
                {text: '巴彦县', code: '230126000000'},
                {text: '木兰县', code: '230127000000'},
                {text: '通河县', code: '230128000000'},
                {text: '延寿县', code: '230129000000'},
                {text: '尚志市', code: '230183000000'},
                {text: '五常市', code: '230184000000'}
            ]
        },
        {
            text: '齐齐哈尔市',
            code: '230200000000',
            children: [
                {text: '全部', code: '230200000000all'},
                {text: '龙沙区', code: '230202000000'},
                {text: '建华区', code: '230203000000'},
                {text: '铁锋区', code: '230204000000'},
                {text: '昂昂溪区', code: '230205000000'},
                {text: '富拉尔基区', code: '230206000000'},
                {text: '碾子山区', code: '230207000000'},
                {text: '梅里斯达斡尔族区', code: '230208000000'},
                {text: '龙江县', code: '230221000000'},
                {text: '依安县', code: '230223000000'},
                {text: '泰来县', code: '230224000000'},
                {text: '甘南县', code: '230225000000'},
                {text: '富裕县', code: '230227000000'},
                {text: '克山县', code: '230229000000'},
                {text: '克东县', code: '230230000000'},
                {text: '拜泉县', code: '230231000000'},
                {text: '讷河市', code: '230281000000'}
            ]
        },
        {
            text: '鸡西市',
            code: '230300000000',
            children: [
                {text: '全部', code: '230300000000all'},
                {text: '鸡冠区',code: '230302000000'},
                {text: '恒山区',code: '230303000000'},
                {text: '滴道区',code: '230304000000'},
                {text: '梨树区',code: '230305000000'},
                {text: '城子河区',code: '230306000000'},
                {text: '麻山区',code: '230307000000'},
                {text: '鸡东县',code: '230321000000'},
                {text: '虎林市',code: '230381000000'},
                {text: '密山市',code: '230382000000'},
            ]
        },
        {
            text: '鹤岗市',
            code: '230400000000',
            children: [
                {text: '全部', code: '230400000000all'},
                {text: '向阳区', code: '230402000000'},
                {text: '工农区', code: '230403000000'},
                {text: '南山区', code: '230404000000'},
                {text: '兴安区', code: '230405000000'},
                {text: '东山区', code: '230406000000'},
                {text: '兴山区', code: '230407000000'},
                {text: '萝北县', code: '230421000000'},
                {text: '绥滨县', code: '230422000000'}
            ]
        },
        {
            text: '双鸭山市',
            code: '230500000000',
            children: [
                {text: '全部', code: '230500000000all'},
                {text: '尖山区', code: '230502000000'},
                {text: '岭东区', code: '230503000000'},
                {text: '四方台区', code: '230505000000'},
                {text: '宝山区', code: '230506000000'},
                {text: '集贤县', code: '230521000000'},
                {text: '友谊县', code: '230522000000'},
                {text: '宝清县', code: '230523000000'},
                {text: '饶河县', code: '230524000000'}
            ]
        },
        {
            text: '大庆市',
            code: '230600000000',
            children: [
                {text: '全部', code: '230600000000all'},
                {text: '萨尔图区', code: '230602000000'},
                {text: '龙凤区', code: '230603000000'},
                {text: '让胡路区', code: '230604000000'},
                {text: '红岗区', code: '230605000000'},
                {text: '大同区', code: '230606000000'},
                {text: '肇州县', code: '230621000000'},
                {text: '肇源县', code: '230622000000'},
                {text: '林甸县', code: '230623000000'},
                {text: '杜尔伯特蒙古族自治县', code: '230624000000'},
                {text: '大庆高新技术产业开发区', code: '230671000000'}
            ]
        },
        {
            text: '伊春市',
            code: '230700000000',
            children: [
                {text: '全部', code: '230700000000all'},
                {text: '伊美区', code: '230717000000'},
                {text: '乌翠区', code: '230718000000'},
                {text: '友好区', code: '230719000000'},
                {text: '嘉荫县', code: '230722000000'},
                {text: '汤旺县', code: '230723000000'},
                {text: '丰林县', code: '230724000000'},
                {text: '大箐山县', code: '230725000000'},
                {text: '南岔县', code: '230726000000'},
                {text: '金林区', code: '230751000000'},
                {text: '铁力市', code: '230781000000'}
            ]  
        },
        {
            text: '佳木斯市',
            code: '230800000000',
            children: [
                {text: '全部', code: '230800000000all'},
                {text: '向阳区', code: '230803000000'},
                {text: '前进区', code: '230804000000'},
                {text: '东风区', code: '230805000000'},
                {text: '郊区', code: '230811000000'},
                {text: '桦南县', code: '230822000000'},
                {text: '桦川县', code: '230826000000'},
                {text: '汤原县', code: '230828000000'},
                {text: '同江市', code: '230881000000'},
                {text: '富锦市', code: '230882000000'},
                {text: '抚远市', code: '230883000000'},
            ]
        },
        {
            text: '七台河市',
            code: '230900000000',
            children: [
                {text: '全部', code: '230900000000all'},
                {text: '新兴区',code: '230902000000'},
                {text: '桃山区',code: '230903000000'},
                {text: '茄子河区',code: '230904000000'},
                {text: '勃利县',code: '230921000000'}
            ]
        },
        {
            text: '牡丹江市',
            code: '231000000000',
            children: [
                {text: '全部', code: '231000000000all'},
                {text: '东安区', code: '231002000000'},
                {text: '阳明区', code: '231003000000'},
                {text: '爱民区', code: '231004000000'},
                {text: '西安区', code: '231005000000'},
                {text: '林口县', code: '231025000000'},
                {text: '牡丹江经济技术开发区', code: '231071000000'},
                {text: '绥芬河市', code: '231081000000'},
                {text: '海林市', code: '231083000000'},
                {text: '宁安市', code: '231084000000'},
                {text: '穆棱市', code: '231085000000'},
                {text: '东宁市', code: '231086000000'}
            ]
        },
        {
            text: '黑河市',
            code: '231100000000',
            children: [
                {text: '全部', code: '231100000000all'},
                {text: '爱辉区',code: '231102000000'},
                {text: '逊克县',code: '231123000000'},
                {text: '孙吴县',code: '231124000000'},
                {text: '北安市',code: '231181000000'},
                {text: '五大连池市',code: '231182000000'},
                {text: '嫩江市',code: '231183000000'}
            ]
        },
        {
            text: '绥化市',
            code: '231200000000',
            children: [
                {text: '全部', code: '231200000000all'},
                {text: '北林区', code: '231202000000'},
                {text: '望奎县', code: '231221000000'},
                {text: '兰西县', code: '231222000000'},
                {text: '青冈县', code: '231223000000'},
                {text: '庆安县', code: '231224000000'},
                {text: '明水县', code: '231225000000'},
                {text: '绥棱县', code: '231226000000'},
                {text: '安达市', code: '231281000000'},
                {text: '肇东市', code: '231282000000'},
                {text: '海伦市', code: '231283000000'}
            ]
        },
        {
            text: '大兴安岭地区',
            code: '232700000000',
            children: [
                {text: '全部', code: '232700000000all'},
                {text: '漠河市', code: '232701000000'},
                {text: '呼玛县', code: '232721000000'},
                {text: '塔河县', code: '232722000000'},
                {text: '加格达奇区', code: '232761000000'},
                {text: '松岭区', code: '232762000000'},
                {text: '新林区', code: '232763000000'},
                {text: '呼中区', code: '232764000000'}
            ]
        }
      ]
    }
  }
}
